app/Controllers/AuthorController.php

SELECT *
FROM `authors`
WHERE `authors`.`author_id` = '1'
---
    public function authors_row()
    {
        $model = new Authors();
        $id = $this->request->getVar('id');
        $data = $model->find($id);

INSERT INTO `authors` (`author_name`) VALUES ('Miko Ino')
---
    public function store()
    {
        $model = new Authors();
        $error = 0;
        $error_author_name = '';

        // Validation rules
        $rules = $this->validate([
            'author_name' => 'required|min_length[5]',
        ]);

        if (!$rules) {
            // Handle validation errors
            $validation = \Config\Services::validation();
            if ($validation->getError('author_name')) {
                $error_author_name = $validation->getError('author_name');
            }
        } else {
            // Validation passed, insert data into the database
            $error = 1;
            $data = [
                'author_name' => $this->request->getVar('author_name'),
            ];
            $model->save($data);

DELETE FROM `authors`
WHERE `author_id` IN ('4')
---
    public function delete()
    {
        $model = new Authors();
        $id = $this->request->getVar('id');
        if ($model->delete($id)) {