app/Controllers/BooksController.php

    public function books_row()
    {
        $model = new Books();
        $id = $this->request->getVar('id');
        $data = $model->find($id);
---
SELECT *
FROM `books`
WHERE `books`.`book_id` = '4'

    public function delete()
    {
        $model = new Books();
        $id = $this->request->getVar('id');
        if($model->delete($id)){
---
DELETE FROM `books`
WHERE `book_id` IN ('6')